{"ticker": "MSFT", "headlines": [{"title": "Microsoft Corporation (MSFT) Unveils Its $10 Billion Investment Plan for AI Infrastructure in a Data Center in Portugal", "publishedAt": "2025-11-15T09:43:27Z"}, {"title": "Why Microsoft (MSFT) Is Spending Billions to Expand Its AI Infrastructure Worldwide", "publishedAt": "2025-11-15T06:10:35Z"}, {"title": "Microsoft Corporation (MSFT) Partners with Pantone to Enable AI Use in Creative and Design Industry", "publishedAt": "2025-11-15T04:50:41Z"}, {"title": "NVDA, MSFT, GOOGL: Ray Dalio’s Bridgewater Loses Confidence in Big Tech, Trims Stakes in Q3", "publishedAt": "2025-11-15T03:53:46Z"}, {"title": "Why These Wall Street Experts Expect Big Things From Nvidia's Earnings Report Next Week", "publishedAt": "2025-11-14T22:46:44Z"}, {"title": "Stocks Settle Mixed as Fed Comments Suggest a Rate Cut Pause", "publishedAt": "2025-11-14T21:45:46Z"}, {"title": "Stock market today: Dow, S&P 500, Nasdaq close mixed to cap a volatile week as Fed cut in doubt", "publishedAt": "2025-11-14T21:00:27Z"}, {"title": "Tech crash alert: $1.5 trillion lost from US stock market in just 48 hours — Nasdaq, S&P 500, Dow fall as rate cut hopes fade", "publishedAt": "2025-11-14T17:13:20Z"}, {"title": "I’m Old Enough to Remember When a 500-Point-Drop in the Dow Jones Was a Crisis. Now It’s Just a Warning.", "publishedAt": "2025-11-14T17:00:02Z"}, {"title": "Why are the Dow, S&P 500 and Nasdaq falling today? Here’s why Wall Street’s top gainers and losers are shifting fast", "publishedAt": "2025-11-14T16:34:11Z"}, {"title": "Microsoft initiated, Home Depot downgraded: Wall Street's top analyst calls", "publishedAt": "2025-11-14T14:38:47Z"}, {"title": "Microsoft (MSFT) Beats Q1 Estimates as Azure’s AI-Driven Cloud Growth Surges Past Expectations", "publishedAt": "2025-11-14T04:20:14Z"}, {"title": "Stock market today: Dow slides, Nasdaq pares losses as Fed rate-cut doubts creep in", "publishedAt": "2025-11-13T23:51:30Z"}, {"title": "If You Invested $1000 In Microsoft Stock 5 Years Ago, You Would Have This Much Today", "publishedAt": "2025-11-13T22:29:42Z"}, {"title": "Stocks Slump on Reduced Fed Rate Cut Chances", "publishedAt": "2025-11-13T21:35:46Z"}, {"title": "The Shutdown Is Over. Winter Is Usually Good For Stocks. Here's Why Investors Are Selling.", "publishedAt": "2025-11-13T21:23:29Z"}, {"title": "fba-finance added to PyPI", "publishedAt": "2025-11-13T20:44:34Z"}, {"title": "Stocks Weighed Down by Weakness in Chipmakers and Megacap Tech Stocks", "publishedAt": "2025-11-13T16:18:36Z"}, {"title": "Palantir CEO Alex Karp warns some AI investments 'may not create enough value' to justify cost", "publishedAt": "2025-11-13T14:30:19Z"}, {"title": "Microsoft (NASDAQ: MSFT) Stock Price Prediction for 2025: Where Will It Be in 1 Year", "publishedAt": "2025-11-13T12:59:55Z"}]}